title: SSH Authentication Failure
id: sigma-ssh-authentication-failure
status: experimental
description: Detects SSH authentication failures for known users.
logsource:
  product: linux
  service: sshd
detection:
  selection:
    event_type:
      - auth_failure
      - failed_login
  condition: selection
fields:
  - ssh_sensor
  - source_ip
  - source_port
  - username
  - event_type
falsepositives:
  - User password mistakes
level: low
tags:
  - attack.credential-access
